# DirectShapeOptions Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DirectShapeOptions Properties
DirectShapeOptions Class See Also
---
The DirectShapeOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ReferencingOption | Whether or not the geometry stored in a DirectShape object may be referenced. |
| RoomBoundingOption | Identifies whether the DirectShape supports an option for the "Room Bounding" parameter to permit participation in room boundary calculations. |

# See Also
DirectShapeOptions Class
Autodesk.Revit.DB Namespace